{"version":"1","records":[{"hierarchy":{"lvl1":"Sample code example"},"type":"lvl1","url":"/","position":0},{"hierarchy":{"lvl1":"Sample code example"},"content":"for i in range (3):\n    print(i)","type":"content","url":"/","position":1},{"hierarchy":{"lvl1":"Start test"},"type":"lvl1","url":"/start","position":0},{"hierarchy":{"lvl1":"Start test"},"content":"Test of Jupyterbook workflow","type":"content","url":"/start","position":1},{"hierarchy":{"lvl1":"Automatisk potteplantevanning"},"type":"lvl1","url":"/microbit-automatisk-vanning","position":0},{"hierarchy":{"lvl1":"Automatisk potteplantevanning"},"content":"","type":"content","url":"/microbit-automatisk-vanning","position":1},{"hierarchy":{"lvl1":"Automatisk potteplantevanning","lvl2":""},"type":"lvl2","url":"/microbit-automatisk-vanning","position":2},{"hierarchy":{"lvl1":"Automatisk potteplantevanning","lvl2":""},"content":"\n\nAv Sigurd Rage, USN","type":"content","url":"/microbit-automatisk-vanning","position":3},{"hierarchy":{"lvl1":"Automatisk potteplantevanning","lvl2":"Introduksjon"},"type":"lvl2","url":"/microbit-automatisk-vanning#introduksjon","position":4},{"hierarchy":{"lvl1":"Automatisk potteplantevanning","lvl2":"Introduksjon"},"content":"I denne aktiviteten skal vi se på hvordan vi kan bruke en microbit til å styre en vannpumpe basert på sensordata fra en jordfuktsensor. Først kommer en beskrivelse av et nesten ferdig system med fuktsensor og pumpe koblet ferdig koblet til microbiten, deretter kommer et forslag til hvordan dette prosjektet kan gjennomføres i klasserommet. Prosjektet krever at man har tilgang på et “breakout board” for microbit, ellers er det utstyret som kreves hyllevare og relativt billig i anskaffelse.\n\nHele prosjektet, med halvferdig kode kan lastes ned her:\n\nhttps://​www​.tinkercad​.com​/things​/0w034yFNd52​?sharecode​=​QMJCpwQsSBU0375orkOx1ITjqXw1VgHsDG9D1CzmHjE\n\n","type":"content","url":"/microbit-automatisk-vanning#introduksjon","position":5},{"hierarchy":{"lvl1":"Automatisk potteplantevanning","lvl2":"Kompetansemål (LK2020)"},"type":"lvl2","url":"/microbit-automatisk-vanning#kompetansem-l-lk2020","position":6},{"hierarchy":{"lvl1":"Automatisk potteplantevanning","lvl2":"Kompetansemål (LK2020)"},"content":"designe og lage et produkt basert på en kravspesifikasjon (4. trinn)\n\nutforske teknologiske systemer som er satt sammen av ulike deler, og beskrive hvordan delene fungerer og virker sammen (4. trinn)\n\ndesigne og lage et produkt basert på brukerbehov (7. trinn)\n\nutforske, lage og programmere teknologiske systemer som består av deler som virker sammen (7. trinn)\n\nbruke programmering til å utforske naturfaglige fenomener (10. trinn)\n\nAktiviteten passer nok best for elever fra 7. trinn og oppover som er vant til å bruke tilleggssutstyr til microbit, feks TinkerKit eller tilsvarende. Det er også et opplegg som kan kobles til elektrisitets- og kretslære.\n\n","type":"content","url":"/microbit-automatisk-vanning#kompetansem-l-lk2020","position":7},{"hierarchy":{"lvl1":"Automatisk potteplantevanning","lvl2":"Utstyrsliste"},"type":"lvl2","url":"/microbit-automatisk-vanning#utstyrsliste","position":8},{"hierarchy":{"lvl1":"Automatisk potteplantevanning","lvl2":"Utstyrsliste"},"content":"Microbit (V1 eller V2)\n\nBreakout board\n\nKoblingsbrett\n\nJordfuktsensor (resistiv type)\n\nMotstand 2.2 kΩ\n\nTransistor NPN (feks BC377)\n\nVannpumpe (3 – 5V)\n\nEksperimentkabler\n\nKrokodillekabler\n\nSlange til vannpumpe\n\nVanntank\n\nPotteplante\n\n","type":"content","url":"/microbit-automatisk-vanning#utstyrsliste","position":9},{"hierarchy":{"lvl1":"Automatisk potteplantevanning","lvl2":"Koblingsskjema og komponenter"},"type":"lvl2","url":"/microbit-automatisk-vanning#koblingsskjema-og-komponenter","position":10},{"hierarchy":{"lvl1":"Automatisk potteplantevanning","lvl2":"Koblingsskjema og komponenter"},"content":"\n\n\n\nI dette skjemaet er jordfuktssensoren koblet til P0 og pumpestyringen koblet til P1. Transistoren virker som en bryter for pumpestyring, og får styringssignalet fra P1. Mellom P1 og transistoren ligger en motstand på 2.2kΩ, da transistoren kun trenger bittelitt strøm for å “slå inn”\n\n","type":"content","url":"/microbit-automatisk-vanning#koblingsskjema-og-komponenter","position":11},{"hierarchy":{"lvl1":"Automatisk potteplantevanning","lvl3":"Jordfuktsensor","lvl2":"Koblingsskjema og komponenter"},"type":"lvl3","url":"/microbit-automatisk-vanning#jordfuktsensor","position":12},{"hierarchy":{"lvl1":"Automatisk potteplantevanning","lvl3":"Jordfuktsensor","lvl2":"Koblingsskjema og komponenter"},"content":"\n\nI dette prosjektet brukes en såkalt resistiv jordfuktssensor, som er den enkleste og billigste typen. Denne sensoren har normalt 3 eller 4 koblingspunkter ut fra modulen. VCC kobles til 3V og GND kobles til 0V. AO (analog out) vil gi en spenning inn på P0 avhengig av hvor fuktig jorden i potteplanten er. På noen sensortyper står det SIG istedet for AO på signalpinnen (se kretstegning)\n\nNoen slike sensorer har også en DO (digital out), denne skal ikke brukes.\n\nSensoren måler elektrisk motstand i plantejorda. Når jorda blir fuktig vil den lede mer strøm mellom elektrodene enn hvis den er tørr. Typisk vil spenningen fra AO være høyere ved tørr jord og lavere ved fuktig jord. Denne spenningsverdien blir avlest som en digital heltallsverdi av microbit, som vi kan bruke i styringsprogrammet til å ta en avgjørelse om potteplanten trenger vanning. For å en fornuftig terskelverdi for vanning bør man teste denne sensoren i jord.\n\nEn svakhet med denne typer sensorer er at de korroderer i fuktig miljø, som gir de en noe kort levetid. Det finnes også kapasitive jordfuktsensorer, som koster noe mer og har litt mer komplisert tilkobling.\n\n","type":"content","url":"/microbit-automatisk-vanning#jordfuktsensor","position":13},{"hierarchy":{"lvl1":"Automatisk potteplantevanning","lvl3":"Vannpumpe","lvl2":"Koblingsskjema og komponenter"},"type":"lvl3","url":"/microbit-automatisk-vanning#vannpumpe","position":14},{"hierarchy":{"lvl1":"Automatisk potteplantevanning","lvl3":"Vannpumpe","lvl2":"Koblingsskjema og komponenter"},"content":"\n\nDette er en vannpumpe som drives av en DC-motor (likestrømsmotor) som krever mellom 3 og 5V. Pumpemotoren trekker en god del strøm, og kan derfor ikke styres direkte fra pinnene til microbiten. Istedet kobles motoren rett på microbitens innebygde strømkilde, pinnene 3V og 0V, men for å kunne styre den, legger vi en transistor imellom. Da vil transistoren fungere som en elektronisk bryter til pumpen.\n\nMicrobit sine tilkoblingsporter kan maksimalt levere 10mA strøm, mens 3V – pinnen kan levere 90mA (V1) eller opptil 120mA (V2).\n\nEn annen ting å ha i bakhodet er at denne pumpen er relativt svak, så vannreservoaret bør være i samme høyde som potteplanten.\n\n","type":"content","url":"/microbit-automatisk-vanning#vannpumpe","position":15},{"hierarchy":{"lvl1":"Automatisk potteplantevanning","lvl3":"Transistor","lvl2":"Koblingsskjema og komponenter"},"type":"lvl3","url":"/microbit-automatisk-vanning#transistor","position":16},{"hierarchy":{"lvl1":"Automatisk potteplantevanning","lvl3":"Transistor","lvl2":"Koblingsskjema og komponenter"},"content":"\n\nTransistoren er en av det 20. århundrets største oppfinnelser og har muliggjort alle de avanserte digitale enhetene vi omgir oss med til daglig. Det er en halvlederkomponent, og har 3 tilkoblinger: Base, Collector og Emitter. I denne kretsen fungerer transistoren rett og slett som en elektronisk bryter, som kan styre om det skal gå strøm igjennom eller ikke. Base kobles i retning mot +3V og Emitter kobles i retning mot 0V (eller GND). Hvorvidt det går strøm gjennom transistoren eller ikke styres av Collector. Det skal svært lite strøm til på Collector for at transistoren leder, derfor kobler vi en relativt stor motstand i serie foran denne terminalen (tilkoblingen). I kretsen under er transistoren satt inn mellom 3V og pumpen. Når det ikke går strøm inn på Base fra P1 vil transistoren sperre for strøm til motoren.\n\nDet er forsåvidt akkurat det samme om transistoren er koblet som vist, eller om den er koblet inn mellom motor og GND\n\n","type":"content","url":"/microbit-automatisk-vanning#transistor","position":17},{"hierarchy":{"lvl1":"Automatisk potteplantevanning","lvl2":"Kretsskjema"},"type":"lvl2","url":"/microbit-automatisk-vanning#kretsskjema","position":18},{"hierarchy":{"lvl1":"Automatisk potteplantevanning","lvl2":"Kretsskjema"},"content":"\n\n\n\nOver ser vi et mer standardisert kretsskjema for prosjektet. I sammenligning med koblingsskjemaet lenge opp er det mer abstrakt, men selve sammenkoblingen av komponentene er mer tydelig og oversiktlig.\n\n","type":"content","url":"/microbit-automatisk-vanning#kretsskjema","position":19},{"hierarchy":{"lvl1":"Automatisk potteplantevanning","lvl2":"Reell oppkobling (kabelspaghetti)"},"type":"lvl2","url":"/microbit-automatisk-vanning#reell-oppkobling-kabelspaghetti","position":20},{"hierarchy":{"lvl1":"Automatisk potteplantevanning","lvl2":"Reell oppkobling (kabelspaghetti)"},"content":"\n\n\n\nAlle skjematiske fremstillinger av kretser ser som regel mye ryddigere ut på papir enn hvordan den faktiske kretsen blir seendes ut på brettet. Hvordan komponentene kobles sammen på koblingsbrettet, og hvordan man får koblet de eksterne delene inn på kretsen krever noe kunnskap om på hvilke måter dette kan gjøres. I litteraturen om teknologi i skolen kalles dette for “handlingskunnskap”.\n\nI dette eksempelet har vi brukt eksperimentkabler, som er ferdig lagde kabler med hann- og hunnterminaler som passer til brettet, samt krokodillekabler for å koble på pumpen.\n\nDet er også fullt mulig å koble at sammen kun med krokodillekabler, uten koblingsbrett, da blir kabelsalaten tilsvarende mer rotete 🙂\n\n","type":"content","url":"/microbit-automatisk-vanning#reell-oppkobling-kabelspaghetti","position":21},{"hierarchy":{"lvl1":"Automatisk potteplantevanning","lvl2":"Programmering av styringsenheten"},"type":"lvl2","url":"/microbit-automatisk-vanning#programmering-av-styringsenheten","position":22},{"hierarchy":{"lvl1":"Automatisk potteplantevanning","lvl2":"Programmering av styringsenheten"},"content":"\n\n\n\nProgrammet over kan være et godt utgangspunkt for styring av pumpen, men den er ikke ferdig. Likevel, et par viktige momenter å ta med seg:\n\nSensorverdier fra jordfuktsensoren leses som analogverdi fra P0\n\nStyring av pumpen skjer ved å sette digital verdi på P1 til 1 (3V) for å starte pumpen, og digital verdi P1 til 0 (0V) for å stoppe den.\n\nI blokken “ved start” setter vi styringssignalet til pumpen til LOW, eller 0V for å være helt sikre på at pumpen ikke starter av seg selv\n\nFor å kunne lese av den digitale verdien fra jordfuktsensoren har vi en kodeblokk “når knapp A trykkes” som skriver denne verdien til skjerm. Dette kan være nyttig for å finne ut hva slags verdier som denne sensoren gir fra tørr eller fuktig jord.\n\nSelve pumpestyringen skjer i “gjenta for alltid”-sløyfen. I denne eksempelkoden er grensen for at pumpen skal starte satt til verdien 500, men den reelle grenseverdien må finnes ved utprøving på en reell potteplante.\n\nDersom avlest verdi er høyere enn grenseverdien vil if-testen slå inn, og pumpen kjøres i 5 sekunder. Denne verdien må også finnes ved eksperimentering: hvor mye vann pumpes per tid, og hvor mye vann trenger potteplanten per vanning.\n\nDeretter venter systemet i 1 minutt før den sjekker fuktigheten i potteplanten på nytt. Dette er nok alt for kort tid i en reell situasjon, og systemet trenger kanskje ikke å sjekke for vanning mer enn et par ganger om dagen. Dessuten trenger potteplanten noe tid for at vannet skal fordeles jevnt i jorden.\n\nAltså:\n\nMan må finne en reell grenseverdi for jordfuktsensoren slik at vanning kommer på ønsket tørrhet\n\nMan må beregne hvor mye vann som trenges for hver vanning, og hvor lang tid dette tar for pumpen\n\nMan må legge inn en generell forsinkelse slik at planten ikke overvannes. Typisk trenger man ikke å sjekke jordfukten mer enn en gang om dagen.\n\nKoden kan lastes ned fra \n\nmakecode.org her: \n\nhttps://​makecode​.microbit​.org​/​_bfKHo6A08Ecc\n\n a + b = c ","type":"content","url":"/microbit-automatisk-vanning#programmering-av-styringsenheten","position":23}]}